Ran Plan for dir: `infrastructure/rds` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.aurora_postgresql_v2.data.aws_partition.current: Reading...
module.aurora_postgresql_v2.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_rds_engine_version.postgresql: Reading...
data.aws_rds_engine_version.postgresql: Read complete after 0s [id=15.2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.aurora_postgresql_v2.aws_rds_cluster.this[0] will be created
+ resource "aws_rds_cluster" "this" {
      + allocated_storage               = (known after apply)
      + allow_major_version_upgrade     = false
      + apply_immediately               = true
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backtrack_window                = 0
      + backup_retention_period         = (known after apply)
      + cluster_identifier              = "dogeapi-db-demo"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = false
      + database_name                   = (known after apply)
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "demo-vpc-demo"
      + db_system_id                    = (known after apply)
      + delete_automated_backups        = true
      + enable_global_write_forwarding  = false
      + enable_http_endpoint            = false
      + enable_local_write_forwarding   = false
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_mode                     = "provisioned"
      + engine_version                  = "15.2"
      + engine_version_actual           = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + iam_roles                       = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + manage_master_user_password     = true
      + master_user_secret              = (known after apply)
      + master_user_secret_kms_key_id   = (known after apply)
      + master_username                 = "root"
      + network_type                    = (known after apply)
      + port                            = 5432
      + preferred_backup_window         = "02:00-03:00"
      + preferred_maintenance_window    = "sun:05:00-sun:06:00"
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = true
      + storage_encrypted               = true
      + storage_type                    = (known after apply)
      + tags                            = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all                        = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + vpc_security_group_ids          = (known after apply)

      + serverlessv2_scaling_configuration {
          + max_capacity = 1
          + min_capacity = 0.5
        }

      + timeouts {}
    }

  # module.aurora_postgresql_v2.aws_rds_cluster_instance.this["one"] will be created
+ resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "demo-vpc-demo"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "15.2"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "dogeapi-db-demo-one"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.serverless"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = (known after apply)
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all                              = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + writer                                = (known after apply)

      + timeouts {}
    }

  # module.aurora_postgresql_v2.aws_rds_cluster_instance.this["two"] will be created
+ resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "demo-vpc-demo"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "15.2"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "dogeapi-db-demo-two"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.serverless"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = (known after apply)
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all                              = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + writer                                = (known after apply)

      + timeouts {}
    }

  # module.aurora_postgresql_v2.aws_security_group.this[0] will be created
+ resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Control traffic to/from RDS Aurora dogeapi-db-demo"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "dogeapi-db-demo-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "demo"
          + "Name"        = "dogeapi-db-demo"
          + "Terraform"   = "True"
        }
      + tags_all               = {
          + "Environment" = "demo"
          + "Name"        = "dogeapi-db-demo"
          + "Terraform"   = "True"
        }
      + vpc_id                 = "vpc-0c37ffe0affae162f"
    }

  # module.aurora_postgresql_v2.aws_security_group_rule.this["vpc_ingress"] will be created
+ resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "10.0.3.0/24",
          + "10.0.4.0/24",
          + "10.0.5.0/24",
        ]
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ aurora_postgresql_v2_additional_cluster_endpoints  = {}
+ aurora_postgresql_v2_cluster_arn                   = (known after apply)
+ aurora_postgresql_v2_cluster_endpoint              = (known after apply)
+ aurora_postgresql_v2_cluster_engine_version_actual = (known after apply)
+ aurora_postgresql_v2_cluster_hosted_zone_id        = (known after apply)
+ aurora_postgresql_v2_cluster_id                    = (known after apply)
+ aurora_postgresql_v2_cluster_instances             = {
      + one = {
          + apply_immediately                     = true
          + arn                                   = (known after apply)
          + auto_minor_version_upgrade            = true
          + availability_zone                     = (known after apply)
          + ca_cert_identifier                    = (known after apply)
          + cluster_identifier                    = (known after apply)
          + copy_tags_to_snapshot                 = false
          + custom_iam_instance_profile           = null
          + db_parameter_group_name               = (known after apply)
          + db_subnet_group_name                  = "demo-vpc-demo"
          + dbi_resource_id                       = (known after apply)
          + endpoint                              = (known after apply)
          + engine                                = "aurora-postgresql"
          + engine_version                        = "15.2"
          + engine_version_actual                 = (known after apply)
          + id                                    = (known after apply)
          + identifier                            = "dogeapi-db-demo-one"
          + identifier_prefix                     = (known after apply)
          + instance_class                        = "db.serverless"
          + kms_key_id                            = (known after apply)
          + monitoring_interval                   = 0
          + monitoring_role_arn                   = (known after apply)
          + network_type                          = (known after apply)
          + performance_insights_enabled          = (known after apply)
          + performance_insights_kms_key_id       = (known after apply)
          + performance_insights_retention_period = (known after apply)
          + port                                  = (known after apply)
          + preferred_backup_window               = (known after apply)
          + preferred_maintenance_window          = "sun:05:00-sun:06:00"
          + promotion_tier                        = 0
          + publicly_accessible                   = (known after apply)
          + storage_encrypted                     = (known after apply)
          + tags                                  = {
              + Environment = "demo"
              + Terraform   = "True"
            }
          + tags_all                              = {
              + Environment = "demo"
              + Terraform   = "True"
            }
          + timeouts                              = {
              + create = null
              + delete = null
              + update = null
            }
          + writer                                = (known after apply)
        }
      + two = {
          + apply_immediately                     = true
          + arn                                   = (known after apply)
          + auto_minor_version_upgrade            = true
          + availability_zone                     = (known after apply)
          + ca_cert_identifier                    = (known after apply)
          + cluster_identifier                    = (known after apply)
          + copy_tags_to_snapshot                 = false
          + custom_iam_instance_profile           = null
          + db_parameter_group_name               = (known after apply)
          + db_subnet_group_name                  = "demo-vpc-demo"
          + dbi_resource_id                       = (known after apply)
          + endpoint                              = (known after apply)
          + engine                                = "aurora-postgresql"
          + engine_version                        = "15.2"
          + engine_version_actual                 = (known after apply)
          + id                                    = (known after apply)
          + identifier                            = "dogeapi-db-demo-two"
          + identifier_prefix                     = (known after apply)
          + instance_class                        = "db.serverless"
          + kms_key_id                            = (known after apply)
          + monitoring_interval                   = 0
          + monitoring_role_arn                   = (known after apply)
          + network_type                          = (known after apply)
          + performance_insights_enabled          = (known after apply)
          + performance_insights_kms_key_id       = (known after apply)
          + performance_insights_retention_period = (known after apply)
          + port                                  = (known after apply)
          + preferred_backup_window               = (known after apply)
          + preferred_maintenance_window          = "sun:05:00-sun:06:00"
          + promotion_tier                        = 0
          + publicly_accessible                   = (known after apply)
          + storage_encrypted                     = (known after apply)
          + tags                                  = {
              + Environment = "demo"
              + Terraform   = "True"
            }
          + tags_all                              = {
              + Environment = "demo"
              + Terraform   = "True"
            }
          + timeouts                              = {
              + create = null
              + delete = null
              + update = null
            }
          + writer                                = (known after apply)
        }
    }
+ aurora_postgresql_v2_cluster_master_username       = (sensitive value)
+ aurora_postgresql_v2_cluster_members               = (known after apply)
+ aurora_postgresql_v2_cluster_port                  = 5432
+ aurora_postgresql_v2_cluster_reader_endpoint       = (known after apply)
+ aurora_postgresql_v2_cluster_resource_id           = (known after apply)
+ aurora_postgresql_v2_cluster_role_associations     = {}
+ aurora_postgresql_v2_db_subnet_group_name          = "demo-vpc-demo"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/rds`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-0:4141/lock?id=appcd-demo%252FDogeAPI%252Finfrastructure%252Frds%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/rds`
</details>
Plan: 5 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`